Revit 2024 API
IFCImportOptions.SetExtraOptions Method
 Set the list of extra options to be passed into the importer. Each entry in the map is a pair of option name and value. Note that any value here will overwrite the other values in the IFCImportOptions, if it has the same name.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public void SetExtraOptions(
	IDictionary<string, string> options
)
Visual Basic
Public Sub SetExtraOptions ( _
	options As IDictionary(Of String, String) _
)
Visual C++
public:
void SetExtraOptions(
	IDictionary<String^, String^>^ options
)
Parameters
options
Type: System.Collections.Generic.IDictionary<String, String>
 The list of options.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
IFCImportOptions Class
Autodesk.Revit.DB.IFC Namespace